## pandas

In [1]:
import pandas as pd

In [7]:
data_frame=pd.DataFrame()

In [8]:
type(data_frame)

pandas.core.frame.DataFrame

In [ ]:
list
dics
series
numpy array

In [9]:
data=[1,2,3,4,5]

In [10]:
pd.DataFrame(data)

   0
0  1
1  2
2  3
3  4
4  5

In [11]:
data2=[["somu",26],["manish",18],["priya",23]]

In [26]:
data_frame2=pd.DataFrame(data2,columns=["name","age"],index=["first","second","third"])

In [27]:
data_frame2

          name  age
first     somu   26
second  manish   18
third    priya   23

In [19]:
data3={"name":["somu","sunny"],"age":[27,25]}

In [21]:
data_frame3=pd.DataFrame(data3)

In [22]:
data_frame3

    name  age
0   somu   27
1  sunny   25

In [23]:
data4=[{"sunny":25},{"somu":31,"amit":35,"rahul":35}]

In [24]:
pd.DataFrame(data4)

   sunny  somu  amit  rahul
0   25.0   NaN   NaN    NaN
1    NaN  31.0  35.0   35.0